Repository: arixbit/Arbor
Catalog: Arbor/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: (branch) onto (shortId(onto)) · (drafts.count) repositories · (totalItems) commits
zh_hans: (branch) onto (shortId(onto)) · (drafts.count) 个仓库 · (totalItems) 个提交

source: %@ merged branches found
zh_hans: 找到 %@ 个已合并分支

source: %@ repositories
zh_hans: %@ 个仓库

source: %@ repositories are currently on this branch and will be skipped.
zh_hans: %@ 个仓库当前正在此分支上，将跳过。

source: %@ repositories available to restore
zh_hans: 可恢复的仓库：%@ 个

source: %@ selected
zh_hans: 已选择 %@ 项

# ↑↓ 导航块
source: ↑↓ navigate blocks
zh_hans: ↑↓ 导航块

source: ↓ Incoming / ↑ Outgoing · Pull selected branch without checkout
zh_hans: ↓ 传入 / ↑ 传出 · 不切换直接 Pull 所选分支

source: A branch, tag, or revision is required.
zh_hans: 需要 branch、tag 或版本。

source: A parent path is already selected
zh_hans: 已选择父路径

source: Abort
zh_hans: 中止

source: About Arbor
zh_hans: 关于 Arbor

source: Accept
zh_hans: 接受

source: Accept Both
zh_hans: 接受双方

source: Accept Both, Reset, manual editing, and Base are unavailable for binary conflicts to avoid corrupting the file.
zh_hans: 二进制冲突不可使用 Accept Both、Reset、手动编辑和 Base，以避免损坏文件。

source: Accept new keys
zh_hans: 接受新密钥

source: Accept Ours
zh_hans: 接受本地版本

source: Accept Theirs
zh_hans: 接受远程版本

source: ACTIONS
zh_hans: 动作

source: Add
zh_hans: 添加

source: Add a GitHub remote before using PRs or issues.
zh_hans: 请先添加 GitHub 远程以使用 PR 和 Issue。

source: Add a GitHub remote to enable PRs and issues.
zh_hans: 添加 GitHub 远程以启用 PR 和 Issue。

source: Add a GitHub, GitLab, or Bitbucket remote to enable PRs and issues.
zh_hans: 添加 GitHub、GitLab 或 Bitbucket 远程仓库以启用 PR 和 Issue。

source: Add changelist (尚未实现：changelist 模型见 IDX-001)
zh_hans: 添加变更列表（尚未实现：changelist 模型见 IDX-001）

source: Add Commits to Remote Branch
zh_hans: 向远程分支添加提交

source: Add Commits to Remote Branch…
zh_hans: 向远程分支添加提交…

source: Add published-commit suffix
zh_hans: 追加已发布提交尾缀

source: Add Remote
zh_hans: 添加远程

source: Add…
zh_hans: 添加…

source: Added
zh_hans: 新增

source: Added line
zh_hans: 新增行

source: Advanced
zh_hans: 高级

source: Advanced rebase options are applied to every repository
zh_hans: 高级 Rebase 选项将应用到每个仓库

source: Align Labels
zh_hans: 对齐标签

source: All
zh_hans: 全部

source: All changes staged
zh_hans: 已暂存全部变更

source: All conflicts resolved
zh_hans: 所有冲突已解决

source: All current tracked changes will be saved to a new stash.
zh_hans: 当前所有已跟踪变更都会保存到新的 stash。

source: All eligible repositories
zh_hans: 所有符合条件的仓库

source: All Git roots are clean.
zh_hans: 所有 Git 根目录都是干净的。

source: All Git roots are resolved
zh_hans: 所有 Git 根目录均已解决

source: All parents
zh_hans: 所有父提交

source: All repositories
zh_hans: 全部仓库

source: Allow unrelated histories
zh_hans: 允许无共同历史的合并

source: Already merged into
zh_hans: 已合并到

source: Already unshelved shelves cleared
zh_hans: 已清理已应用 Shelf

source: Also delete common local tracking branches
zh_hans: 同时删除共同的本地 tracking 分支

source: An identity file enables IdentitiesOnly so OpenSSH does not try unrelated agent keys.
zh_hans: 身份文件会启用 IdentitiesOnly，避免 OpenSSH 尝试无关的代理密钥。

source: Application language
zh_hans: 应用语言

source: Application Language
zh_hans: 应用语言

source: Applied files will be moved to Recently Deleted.
zh_hans: 已应用文件将移入最近删除。

source: Apply
zh_hans: 应用

source: Apply Changes
zh_hans: 应用变更

source: Apply Selected Changes
zh_hans: 应用选中的变更

source: Apply selected changes to the working tree.
zh_hans: 将选中的变更应用到工作区。

source: Apply selected changes?
zh_hans: 应用选中的变更？

source: Apply the selected shelves to one Changelist.
zh_hans: 将选中的 Shelf 应用到一个 Changelist。

source: Apply to Selected
zh_hans: 应用到选中

source: Arbor helps you review changes, manage branches, resolve conflicts, and work with Git remotes in a focused native macOS app.
zh_hans: Arbor 帮助你在专注的原生 macOS 应用中查看变更、管理分支、解决冲突并使用 Git 远程仓库。

source: Arbor records operation names, version, repository basename, and error codes only.
zh_hans: Arbor 仅记录操作名称、版本、仓库名称和错误码。

source: Arbor-managed state
zh_hans: Arbor 托管状态

source: Architecture
zh_hans: 架构

source: Ask before trusting
zh_hans: 信任前询问

source: Attributes
zh_hans: 文件属性

source: Authentication failed. Enter the credentials again.
zh_hans: 认证失败，请重新输入凭证。

source: Authentication method
zh_hans: 身份验证方式

source: Author
zh_hans: 作者

source: Auto-fetch failed
zh_hans: 自动 Fetch 失败

source: Auto-fetch incoming changes
zh_hans: 自动 Fetch 传入变更

source: Automatic
zh_hans: 自动

source: Automatic uses the OpenSSH default order. SSH key only restricts authentication to public keys; password mode enables password and keyboard-interactive prompts.
zh_hans: 自动模式使用 OpenSSH 默认顺序；仅 SSH 密钥模式限制为公钥认证；密码模式启用密码和键盘交互提示。

source: Autosquash
zh_hans: 自动压缩提交

source: Backup branches kept
zh_hans: 已保留的备份分支

source: Bad signature
zh_hans: 签名无效

source: Base
zh_hans: 基准

source: Base branch
zh_hans: 目标分支

source: Base（共同祖先）
zh_hans: 基准（共同祖先）

source: Before Commit Checks
zh_hans: 提交前检查

source: Before-commit settings
zh_hans: 提交前设置

source: Binary
zh_hans: 二进制

source: Binary Conflict
zh_hans: 二进制冲突

source: Binary file — diff preview unavailable
zh_hans: 二进制文件 — 无法预览 Diff

source: Binary file cannot be previewed as text
zh_hans: 二进制文件无法预览为文本

source: Branch
zh_hans: 分支

source: Branch / tag / revision
zh_hans: 分支 / 标签 / 版本

source: Branch %1$@ already exists in %2$@.
zh_hans: 分支 %1$@ 已存在于 %2$@。

source: Branch checked out
zh_hans: 已切换分支

source: Branch created
zh_hans: 分支已创建

source: Branch deleted
zh_hans: 分支已删除

source: Branch deletion cancelled
zh_hans: 已取消删除分支

source: Branch is not fully merged
zh_hans: 分支尚未完全合并

source: Branch name
zh_hans: 分支名

source: branch or revision
zh_hans: 分支或版本

source: Branch renamed
zh_hans: 分支已重命名

source: Branch restored
zh_hans: 分支已恢复

source: branch to rebase
zh_hans: 要 Rebase 的分支

source: Branches
zh_hans: 分支

source: BRANCHES
zh_hans: 分支

source: Branches deleted
zh_hans: 分支已删除

source: Branches Popup Settings
zh_hans: 分支弹窗设置

source: Branches: checkout / pull / push / fetch / merge / rebase / stash
zh_hans: 分支：切换 / pull / push / fetch / merge / rebase / stash

source: Branches…
zh_hans: 分支…

source: Browse Repository at Revision
zh_hans: 在此版本浏览仓库

source: Browse…
zh_hans: 浏览…

source: Bug report
zh_hans: 问题报告

source: Built with SwiftUI and Rust.
zh_hans: 基于 SwiftUI 和 Rust 构建。

source: Calculate
zh_hans: 计算

source: Calculation unavailable in this repository
zh_hans: 此仓库无法完成计算

source: Cancel
zh_hans: 取消

source: Canceling…
zh_hans: 正在取消…

source: Changelists
zh_hans: 变更列表

source: Changes
zh_hans: 变更

source: Changes · All Git Roots
zh_hans: 变更 · 全部 Git 根目录

source: Changes shelved
zh_hans: 变更已放入 Shelf

source: Changes staged
zh_hans: 变更已暂存

source: Changes stashed
zh_hans: 变更已存入 stash

source: Changes unstaged
zh_hans: 变更已取消暂存

source: Check remote only (LS_REMOTE)
zh_hans: 仅检查远端（LS_REMOTE）

source: Check the branch upstream and remote-tracking branch, then retry.
zh_hans: 检查分支 upstream 和远程跟踪分支后重试。

source: Check the file permissions and retry.
zh_hans: 检查文件权限后重试。

source: Check the remote and authentication settings, then retry.
zh_hans: 检查 remote 和认证设置后重试。

source: Check the remote credentials in Settings, then retry.
zh_hans: 在设置中检查远程凭证后重试。

source: Check the repository and reference, then retry.
zh_hans: 检查仓库和引用后重试。

source: Check the repository and retry.
zh_hans: 检查仓库后重试。

source: Check the SSH settings and enter one credential helper per line, then retry.
zh_hans: 检查 SSH 设置，并确保每行填写一个凭证助手后重试。

source: Checkout
zh_hans: 切换

source: Checkout and Update
zh_hans: 切换并更新

source: Checkout branch
zh_hans: 切换到新分支

source: Checkout reference
zh_hans: 检出引用

source: Checkout reference failed
zh_hans: 检出引用失败

source: Checkout Revision
zh_hans: 检出版本

source: Checkout Tag or Revision…
zh_hans: 检出 Tag 或版本…

source: Checkout with Rebase
zh_hans: 切换并以 Rebase 更新

source: Checkout, reset, branch, compare and rebase require one selected revision.
zh_hans: 检出、重置、建分支、比较和变基要求只选择一个版本。

source: Cherry-pick Selected Commits
zh_hans: Cherry-pick 所选提交

source: Cherry-picked commit
zh_hans: 已 Cherry-pick 的提交

source: Choose a valid Git repository and retry.
zh_hans: 选择有效的 Git 仓库后重试。

source: Choose how the selected Git changes are written. The patch remains a portable Git patch.
zh_hans: 选择如何写出选中的 Git 变更。补丁仍是可移植的 Git 补丁。

source: Choose or clear Paths filter
zh_hans: 选择或清除路径筛选

source: Choose source branch…
zh_hans: 选择源分支…

source: Choose the language Arbor uses for menus and interface.
zh_hans: 选择 Arbor 菜单和界面使用的语言。

source: Choose the tool names Git uses for merge conflicts. Configure each command with Git's mergetool.<name>.cmd settings.
zh_hans: 选择 Git 处理合并冲突时使用的工具名称。请使用 Git 的 mergetool.<name>.cmd 配置每个命令。

source: Cleanup Branches
zh_hans: 清理分支

source: Cleanup…
zh_hans: 清理…

source: Clear
zh_hans: 清除

source: Clear All
zh_hans: 全部清除

source: Clear All Stashes
zh_hans: 清空所有 Stash

source: Clear Already Unshelved
zh_hans: 清理已应用 Shelf

source: Clear already unshelved shelves failed
zh_hans: 清理已应用 Shelf 失败

source: Clear Filter
zh_hans: 清除过滤

source: Clear Recent Filters
zh_hans: 清除最近筛选

source: Clear Text Filter
zh_hans: 清除文本过滤

source: Clear Token
zh_hans: 清除 Token

source: Clipboard uses Unicode text
zh_hans: 剪贴板使用 Unicode 文本

source: Close
zh_hans: 关闭

source: Closed
zh_hans: 已关闭

source: Cmd-click / Shift-click
zh_hans: 按住 Cmd / Shift 点击

source: Co-authors (one Name <email> per line)
zh_hans: 共同作者（每行一个 Name <email>）

source: Code
zh_hans: 代码

source: Collapse Graph
zh_hans: 折叠图形

source: Collapse linear branch
zh_hans: 折叠线性分支

source: Command, e.g. cargo
zh_hans: 命令，例如 cargo

source: Comment this commit
zh_hans: 评论此提交

source: comments
zh_hans: 条评论

source: Commit
zh_hans: 提交

source: Commit All
zh_hans: 提交全部

source: Commit and Push…
zh_hans: 提交并推送…

source: Commit and Rebase
zh_hans: 提交并变基

source: Commit Changes
zh_hans: 提交变更

source: Commit checks failed
zh_hans: 提交检查失败

source: commit hash or revision
zh_hans: 提交哈希或版本

source: Commit message
zh_hans: 提交信息

source: Commit Message
zh_hans: 提交信息

source: Commit message (optional)
zh_hans: 提交信息（可选）

source: Commit or stash the local changes, then retry.
zh_hans: 提交或 stash 本地变更后重试。

source: Commit Selected
zh_hans: 提交所选根目录

source: Commit Signature
zh_hans: 提交签名

source: Commit…
zh_hans: 提交…

source: Commits
zh_hans: 提交

source: Compact References
zh_hans: 紧凑显示引用

source: Compare
zh_hans: 比较

source: Compare actions
zh_hans: 比较操作

source: Compare Before with Local
zh_hans: 与变更前本地版本比较

source: Compare Three Versions
zh_hans: 三版本比较

source: Compare with Current…
zh_hans: 与当前版本比较…

source: Compare with Local
zh_hans: 与本地版本比较

source: Compared branch
zh_hans: 比较分支

source: Complete Merge
zh_hans: 完成合并

source: Complete Shelve Pop
zh_hans: 完成 Shelve Pop

source: Complete shelve restore
zh_hans: 完成 Shelf 恢复

source: Complete shelve restore failed
zh_hans: 完成 Shelf 恢复失败

source: Complete Unshelve
zh_hans: 完成 Unshelve

source: Configure a GitHub token in Settings, then retry the git operation.
zh_hans: 请在设置中配置 GitHub Token，然后重试 git 操作。

source: Configure a token in Settings to continue.
zh_hans: 请在设置中配置 Token 以继续。

source: Configure GitHub token
zh_hans: 配置 GitHub Token

source: Configure Remotes
zh_hans: 配置远程

source: Configure Remotes…
zh_hans: 配置远程…

source: Configure token
zh_hans: 配置 token

source: Configured before-commit checks run separately for every selected root.
zh_hans: 已配置的提交前检查会分别在每个选中根目录中执行。

source: Conflicts
zh_hans: 冲突

source: CONFLICTS
zh_hans: 冲突

source: Connected as %@
zh_hans: 已连接：%@

source: Content truncated
zh_hans: 内容已截断

source: Continue
zh_hans: 继续

source: Copied branch name
zh_hans: 已复制分支名称

source: Copy
zh_hans: 复制

source: Copy Commit ID
zh_hans: 复制提交 ID

source: Copy Commit Message
zh_hans: 复制提交信息

source: Copy Current Branch Name
zh_hans: 复制当前分支名称

source: Copy path
zh_hans: 复制路径

source: Copy Path
zh_hans: 复制路径

source: Copy Paths
zh_hans: 复制路径

source: Copy Relative Path
zh_hans: 复制相对路径

source: Copy Repository Link
zh_hans: 复制仓库链接

source: Copy Selected Paths
zh_hans: 复制选中文件路径

source: Copy Selected Revision IDs
zh_hans: 复制选中版本 ID

source: Create
zh_hans: 创建

source: Create a patch for one selected commit
zh_hans: 为一个选中的提交创建补丁

source: Create Branch from Commit
zh_hans: 从提交创建分支

source: Create Branch…
zh_hans: 创建分支…

source: Create Changelists automatically
zh_hans: 自动创建变更列表

source: Create Fixup Commit…
zh_hans: 创建 Fixup 提交…

source: Create from
zh_hans: 创建自

source: Create in Git roots
zh_hans: 在 Git 根仓库中创建

source: Create Patch…
zh_hans: 创建补丁…

source: Create Squash Commit…
zh_hans: 创建 Squash 提交…

source: Credential Helpers
zh_hans: 凭证助手

source: Current
zh_hans: 当前

source: Date
zh_hans: 日期

source: Default / automatic
zh_hans: 默认 / 自动

source: Deinit
zh_hans: 反初始化

source: Delete
zh_hans: 删除

source: Delete %@ from Git roots
zh_hans: 从 Git root 删除 %@

source: Delete Anyway
zh_hans: 仍然删除

source: Delete anyway? This permanently removes the local branch reference and can discard commits.
zh_hans: 仍然删除？这会永久移除本地分支引用，并可能丢弃提交。

source: Delete backup branch
zh_hans: 删除备份分支

source: Delete backup branch failed
zh_hans: 删除备份分支失败

source: Delete branch
zh_hans: 删除分支

source: Delete Branch
zh_hans: 删除分支

source: Delete branch failed
zh_hans: 删除分支失败

source: Delete Branch…
zh_hans: 删除分支…

source: Delete in Repositories…
zh_hans: 在多个仓库中删除…

source: Delete merged branch unavailable
zh_hans: 无法删除已合并分支

source: Delete on Remote
zh_hans: 从远程删除

source: Delete Permanently
zh_hans: 永久删除

source: Delete Permanently Selected
zh_hans: 永久删除选中项

source: Delete Selected
zh_hans: 删除所选项

source: Delete selected branches
zh_hans: 删除选中的分支

source: Delete Tag
zh_hans: 删除标签

source: Deleted
zh_hans: 删除

source: Deleted line
zh_hans: 删除行

source: Detached
zh_hans: Detached HEAD

source: Development Build
zh_hans: 开发版本

source: Diff Preview on Bottom
zh_hans: 在底部显示 Diff 预览

source: dirty
zh_hans: 有未提交变更

source: Do Not Ask Again
zh_hans: 不再询问

source: Do not check incoming changes
zh_hans: 不检查传入变更

source: Do not commit automatically
zh_hans: 不自动提交

source: Do not verify (unsafe)
zh_hans: 不验证（不安全）

source: Done
zh_hans: 完成

source: Draft
zh_hans: 草稿

source: Drag to resize Commit and Project panels
zh_hans: 拖动调整提交和项目面板大小

source: Drag to resize left and right workspaces
zh_hans: 拖动调整左右工作区大小

source: Dragged Shelf
zh_hans: 拖拽 Shelf

source: Drop Commit…
zh_hans: 丢弃提交…

source: Drop Selected
zh_hans: 删除所选成员

source: Drop Selected Changes…
zh_hans: 丢弃选中的变更…

source: Drop Selected Commits…
zh_hans: 丢弃选中的提交…

source: Drop Selected Shelves
zh_hans: 删除所选 Shelf

source: Drop shelves
zh_hans: 删除 Shelf

source: e.g. ssh -i ~/.ssh/id_ed25519
zh_hans: 例如 ssh -i ~/.ssh/id_ed25519

source: Each repository has its own todo list. Changes to one section do not affect another repository.
zh_hans: 每个仓库都有独立的 todo 列表；修改一个分区不会影响其他仓库。

source: Edit .git/info/exclude
zh_hans: 编辑 .git/info/exclude

source: Edit .gitignore
zh_hans: 编辑 .gitignore

source: Edit Paths
zh_hans: 编辑路径

source: Edit Paths…
zh_hans: 编辑路径…

source: Edit Remote
zh_hans: 编辑远程

source: Edit Source
zh_hans: 编辑源文件

source: Edit source unavailable
zh_hans: 无法编辑源文件

source: Edit the combined commit message. The selected commits will be replayed as one commit.
zh_hans: 编辑合并后的提交信息。所选提交将作为一个提交重放。

source: Edit todo for all repositories
zh_hans: 编辑所有仓库的 Rebase todo

source: Edit…
zh_hans: 编辑…

source: Effective line endings
zh_hans: 有效换行

source: Empty cherry-picks are skipped by default. When enabled, cherry-picks of commits already reachable from a protected remote branch append the standard Git origin trailer.
zh_hans: 空 Cherry-pick 默认跳过。启用后，已从受保护远程分支可达的提交会追加标准 Git 来源尾缀。

source: Enable Auto-fetch
zh_hans: 启用自动 Fetch

source: Enable Highlighting
zh_hans: 启用高亮

source: Encoding
zh_hans: 编码

source: Enter a pull request number, file path, line number, and comment.
zh_hans: 请输入 PR 编号、文件路径、行号和评论。

source: Enter branch, tag, or commit
zh_hans: 输入 branch、tag 或 commit

source: Enter one argument per line. Commands run as argv without a shell.
zh_hans: 每个参数单独占一行；命令按 argv 执行，不经过 shell。

source: Enter one path per line
zh_hans: 每行输入一个路径

source: EOL
zh_hans: 换行

source: Every repository must have a valid todo before starting
zh_hans: 开始前每个仓库都必须有有效的 todo

source: Exclude (.git/info/exclude)
zh_hans: 排除（写入 .git/info/exclude）

source: Execute custom clean/smudge filters and working-tree encodings
zh_hans: 执行自定义 clean/smudge 过滤器和工作区编码

source: Expand collapsed branch
zh_hans: 展开已折叠分支

source: Export Logs…
zh_hans: 导出日志…

source: Export Patch…
zh_hans: 导出补丁…

source: External merge tool canceled.
zh_hans: 外部合并工具已取消。

source: External merge tool resolved the file.
zh_hans: 外部合并工具已解决该文件。

source: External merge tool returned; conflicts remain.
zh_hans: 外部合并工具已返回，但仍有冲突。

source: External Tool
zh_hans: 外部工具

source: Extract Selected Changes…
zh_hans: 抽取选中的变更…

source: Failed or skipped repositories
zh_hans: 失败或跳过的仓库

source: Failed or stopped repositories
zh_hans: 失败或已停止的仓库

source: Fetch after adding
zh_hans: 添加后 Fetch

source: Fetch after saving
zh_hans: 保存后 Fetch

source: Fetch All
zh_hans: Fetch 全部

source: Fetch all completed
zh_hans: 所有 remote Fetch 完成

source: Fetch Full History…
zh_hans: 获取完整历史…

source: Fetch Remote Branch
zh_hans: 获取远程分支

source: Fetch the selected remote branch, replay the selected commits in memory, then open Push with the new detached tip.
zh_hans: 先 Fetch 选中的远程分支，在内存中重放选中的提交，然后使用新的 detached tip 打开 Push。

source: Fetches all configured remotes for every Git root every five minutes while a project window is open.
zh_hans: 项目窗口打开期间，每 5 分钟为每个 Git root 的所有已配置 remote 执行 Fetch。

source: file
zh_hans: 文件

source: File
zh_hans: 文件

source: File path
zh_hans: 文件路径

source: File restored
zh_hans: 文件已恢复

source: Filter
zh_hans: 过滤器

source: Filter branches
zh_hans: 过滤分支

source: Filter By
zh_hans: 过滤

source: Filter by Repository
zh_hans: 按仓库过滤

source: Filter Log Here
zh_hans: 在此过滤日志

source: Filter prefix
zh_hans: 名称前缀

source: Filtering changes…
zh_hans: 正在过滤变更…

source: Find
zh_hans: 查找

source: Find merged branches
zh_hans: 查找已合并分支

source: Find merged branches cancelled
zh_hans: 查找已合并分支已取消

source: Find merged branches incomplete
zh_hans: 查找已合并分支未完成

source: Find Merged Branches…
zh_hans: 查找已合并分支…

source: Find Merged Local Branches
zh_hans: 查找已合并的本地分支

source: Find Merged…
zh_hans: 查找已合并分支…

source: Finding merged branches…
zh_hans: 正在查找已合并分支…

source: Flatten Directories
zh_hans: 扁平显示目录

source: follow
zh_hans: 跟随

source: Follow current branch
zh_hans: 跟随当前分支

source: Force delete branch
zh_hans: 强制删除分支

source: Force delete branch failed
zh_hans: 强制删除分支失败

source: force push
zh_hans: 强制推送

source: Force push is disabled for this protected branch.
zh_hans: 受保护分支已禁用强制推送。

source: Force-pushed backup branch kept
zh_hans: 已保留强制推送更新的备份分支

source: Get file version
zh_hans: 获取文件版本

source: Get file version failed
zh_hans: 获取文件版本失败

source: Get file version?
zh_hans: 获取文件版本？

source: Get Version
zh_hans: 获取此版本

source: Git Authentication
zh_hans: Git 身份验证

source: Git controls the merge topology; pick, reword, edit, and drop remain available, but order is fixed.
zh_hans: Git 控制 merge 拓扑；仍可使用 pick、reword、edit、drop，但顺序固定。

source: Git Executable
zh_hans: Git 可执行文件

source: Git executable is valid
zh_hans: Git 可执行文件有效

source: Git executable saved
zh_hans: Git 可执行文件已保存

source: Git External Merge Tool
zh_hans: Git 外部合并工具

source: Git identity
zh_hans: Git 身份

source: Git Incoming Changes
zh_hans: Git 传入变更

source: Git Log Command
zh_hans: Git Log 命令

source: Git Roots
zh_hans: Git 根目录

source: Git Roots Conflicts
zh_hans: Git 根目录冲突

source: Git SSH Command
zh_hans: Git SSH 命令

source: GitHub API rate limit exceeded.
zh_hans: GitHub API 已达到速率限制。

source: GitHub authentication failed
zh_hans: GitHub 认证失败

source: GitHub authentication failed.
zh_hans: GitHub 认证失败。

source: GitHub authentication required
zh_hans: 需要 GitHub 认证

source: GitHub device sign-in
zh_hans: GitHub 设备登录

source: GitHub Repository
zh_hans: GitHub 仓库

source: GitHub returned an invalid response.
zh_hans: GitHub 返回了无效响应。

source: GitHub Settings
zh_hans: GitHub 设置

source: GitHub user
zh_hans: GitHub 用户

source: Go to Child
zh_hans: 转到子提交

source: Go to Parent
zh_hans: 转到父提交

source: Group by directory
zh_hans: 按目录分组

source: Group by Directory
zh_hans: 按目录分组

source: Group by repository
zh_hans: 按仓库分组

source: GUI merge tool name (optional)
zh_hans: GUI 合并工具名称（可选）

source: Hash
zh_hans: 哈希

source: HEAD %@ · Edit the complete commit message. Staged changes are not included.
zh_hans: HEAD %@ · 编辑完整提交信息。不会包含已暂存的变更。

source: Head branch
zh_hans: 源分支

source: Hide branches
zh_hans: 隐藏分支

source: Hide changes preview
zh_hans: 隐藏变更预览

source: Hide Files
zh_hans: 隐藏文件

source: Hide patch preview
zh_hans: 隐藏补丁预览

source: Hide stash preview
zh_hans: 隐藏 Stash 预览

source: Highlight Cherry-Picked Commits
zh_hans: 高亮 Cherry-pick 提交

source: History
zh_hans: 历史

source: Host key verification
zh_hans: 主机密钥验证

source: Host-key verification is disabled for this repository.
zh_hans: 此仓库已关闭主机密钥验证。

source: Hosted rules are added to the local protected patterns after a successful fetch. Cached rules remain active if synchronization fails.
zh_hans: Fetch 成功后会将托管平台规则加入本地保护规则；同步失败时仍保留缓存规则。

source: Hosted rules are added to this project's protected patterns after a successful fetch. Cached rules remain active if synchronization fails.
zh_hans: Fetch 成功后会将托管平台规则加入此项目的保护规则；同步失败时仍保留缓存规则。

source: Hosting
zh_hans: 托管

source: Identity file (optional)
zh_hans: 身份文件（可选）

source: Ignore (add to .gitignore)
zh_hans: 忽略（写入 .gitignore）

source: Import Patches…
zh_hans: 导入补丁…

source: Include ignored files（隐含 untracked）
zh_hans: 包含被忽略文件（隐含未跟踪）

source: Include untracked files
zh_hans: 包含未跟踪文件

source: Incoming changes available
zh_hans: 发现传入变更

source: Incoming changes check
zh_hans: 传入变更检查

source: Incoming changes check failed
zh_hans: 传入变更检查失败

source: init
zh_hans: 初始化

source: Initialize the submodule to inspect its commit range.
zh_hans: 初始化子模块以查看其提交范围。

source: Intent-to-add failed
zh_hans: 意向暂存失败

source: Intent-to-add staged
zh_hans: 已暂存意向文件

source: Interactive Rebase unavailable
zh_hans: 无法进行 Interactive Rebase

source: Issues
zh_hans: Issue

source: Keep empty commits
zh_hans: 保留空提交

source: Keep original
zh_hans: 保留原样

source: Keep Partial
zh_hans: 保留部分结果

source: Known hosts file (optional)
zh_hans: Known hosts 文件（可选）

source: Language
zh_hans: 语言

source: Language Settings…
zh_hans: 语言设置…

source: Language…
zh_hans: 语言…

source: last commit
zh_hans: 最近一次提交

source: Last commit
zh_hans: 最后提交

source: Last successful SSH authentications
zh_hans: 最近成功的 SSH 认证

source: License
zh_hans: 许可

source: Line number
zh_hans: 行号

source: Load merged branch roots
zh_hans: 加载已合并分支仓库

source: Load merged branch roots failed
zh_hans: 加载已合并分支仓库失败

source: Load Range
zh_hans: 加载范围

source: Loading Changes Failed
zh_hans: 加载变更失败

source: Loading changes…
zh_hans: 正在加载变更…

source: Loading diff…
zh_hans: 正在加载 diff…

source: Loading repositories…
zh_hans: 正在加载仓库…

source: Loading signature status
zh_hans: 正在加载签名状态

source: Loading staged changes…
zh_hans: 正在加载已暂存变更…

source: Loading three versions…
zh_hans: 正在加载三个版本…

source: Loading…
zh_hans: 加载中…

source: LOCAL BRANCHES
zh_hans: 本地分支

source: Local changes detected
zh_hans: 检测到本地变更

source: Local changes would be overwritten
zh_hans: 本地变更将被覆盖

source: Local credential.helper values
zh_hans: 本地 credential.helper 值

source: Log
zh_hans: 日志

source: Log Columns
zh_hans: 日志列

source: LS_REMOTE checks configured upstreams without changing local refs; Auto-fetch updates every Git root every five minutes.
zh_hans: LS_REMOTE 检查已配置的 upstream，但不会修改本地引用；自动 Fetch 每 5 分钟更新每个 Git root。

source: Match Case
zh_hans: 区分大小写

source: Maximum 100 paths can be selected
zh_hans: 最多可选择 100 个路径

source: Merge Branch
zh_hans: 合并分支

source: Merge in Repositories…
zh_hans: 在多个仓库中合并…

source: Merge into Current…
zh_hans: 合并到当前分支…

source: Merge options
zh_hans: 合并选项

source: Merge Revisions
zh_hans: 合并版本

source: Merge rollback completed
zh_hans: 合并回滚完成

source: Merge rollback failed
zh_hans: 合并回滚失败
